package 临时;

import org.junit.Test;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

/**
 * @author MR.Z
 * @date 2020/8/26 1:25
 */
public class 最强蜗牛抽奖周 {
    //需手动设置数据
    int 目前活动剩余天数 = 7;

    int 抽奖券_目前拥有 = 111;

    int 嘉年华气球_目前拥有 = 0;

    //根据古代货币按需购买 
    int 抽奖券_地缝商人_3或6 = 15;
    int 抽奖券_预计可完成三档奖励 = 2 + 4 + 6;
    //以下是固定数据 不需要修改
    int 抽奖券_周礼包_3 = 3;
    int 抽奖券_每日礼包_3 = 3;
    int 抽奖券_每日贩售机_8 = 8;

    int 嘉年华气球_周礼包_100 = 100;
    int 嘉年华气球_每日礼包_100 = 100;
    int 嘉年华气球_学徒手礼_30_最大450 = 450;
    int 嘉年华气球_专家手礼_75_最大750 = 750;
    int 嘉年华气球_大师或宗师_200_最大1000 = 1000;
    int 嘉年华气球_消耗白蝌蚪_600 = 600;
    //前5次抽奖档位每次获得10抽奖券
    List<Integer> 嘉年华气球_档位所需抽奖券List = new ArrayList<>(Arrays.asList(30, 60, 100, 150, 200, 300, 400, 500));
    List<Integer> 嘉年华气球_抽奖奖励List = new ArrayList<>(Arrays.asList(120, 120, 120, 120, 120, 150, 150, 200));

    @Test
    public void test01() {
        int 总计可获得抽奖券 = 总计可获得抽奖券();
        System.out.println("总计可获得抽奖券" + 总计可获得抽奖券);
        System.out.println("==================");
        int 总计可获得嘉年华气球 = 总计可获得嘉年华气球(总计可获得抽奖券);//目前最大支持249枚抽奖券
        System.out.println("总计可获得嘉年华气球" + 总计可获得嘉年华气球);
        int i = 500 + 1000 + 1500 + 3000;
        System.out.println("第四档合计需要嘉年华气球" + i);
        System.out.println("第四档还需要嘉年华气球" + (i - 总计可获得嘉年华气球));
    }

    public int 总计可获得抽奖券() {

        int 抽奖券 = 抽奖券_目前拥有 + 抽奖券_每日礼包_3 * 目前活动剩余天数 + 抽奖券_每日贩售机_8 * 目前活动剩余天数 + 抽奖券_周礼包_3
                + 抽奖券_地缝商人_3或6 + 抽奖券_预计可完成三档奖励;
        int 可完成轮次 = 抽奖券 / 500;
        System.out.println("可完成轮次" + 可完成轮次);
        //每完成一轮可获得50
        if (可完成轮次 >= 1) {
            抽奖券 = 抽奖券 + 可完成轮次 * 50;
        }
        int 完成轮次后剩余抽奖券 = 抽奖券 - 500 * 可完成轮次;
        System.out.println("完成轮次后剩余抽奖券_计算还可以获得多少抽奖券_奖励前" + 完成轮次后剩余抽奖券);
        //如果大于等于160 则可获得50抽奖券
        if (完成轮次后剩余抽奖券 < 50) {
            抽奖券 += 10;
        } else if (完成轮次后剩余抽奖券 < 80) {
            抽奖券 += 20;
        } else if (完成轮次后剩余抽奖券 < 120) {
            抽奖券 += 30;
        } else if (完成轮次后剩余抽奖券 >= 160) {
            抽奖券 += 50;
        } else {
            抽奖券 += 40;
        }
        return 抽奖券;
    }

    public int 总计可获得嘉年华气球(int 总计可获得抽奖券) {
        int 可完成轮次 = 总计可获得抽奖券 / 500;
        int 抽奖获得的嘉年华气球 = 0;
        if (可完成轮次 >= 1) {
            抽奖获得的嘉年华气球 = 可完成轮次 * 1100;
        }
        //该抽奖券数量已经计算抽奖奖励所给的
        int 完成轮次后剩余抽奖券 = 总计可获得抽奖券 - 500 * 可完成轮次;
        System.out.println("完成轮次后剩余抽奖券_计算还可获得多少嘉年华气球_奖励后" + 完成轮次后剩余抽奖券);
        int 档位 = 0;
        for (int i = 0; i < 嘉年华气球_档位所需抽奖券List.size(); i++) {
            if (完成轮次后剩余抽奖券 >= 嘉年华气球_档位所需抽奖券List.get(i)) {
                档位 = i + 1;
            }
        }
        System.out.println("List档位" + 档位);
        int 剩余抽奖券可获得嘉年华气球 = 0;
        for (int i = 0; i < 档位; i++) {
            剩余抽奖券可获得嘉年华气球 += 嘉年华气球_抽奖奖励List.get(i);
        }
        System.out.println("剩余抽奖券可获得嘉年华气球" + 剩余抽奖券可获得嘉年华气球);
        抽奖获得的嘉年华气球 += 剩余抽奖券可获得嘉年华气球;
        int i = 嘉年华气球_目前拥有 + 嘉年华气球_每日礼包_100 * 目前活动剩余天数 + 嘉年华气球_周礼包_100 + 嘉年华气球_学徒手礼_30_最大450
                + 嘉年华气球_专家手礼_75_最大750 + 嘉年华气球_大师或宗师_200_最大1000 + 嘉年华气球_消耗白蝌蚪_600 + 抽奖获得的嘉年华气球;
        System.out.println("==================");
        return i;
    }
}
